review-evidence/440-r1/reviews/R225-1/mutations/drop-style-close/change.patch
--- head/scripts/gen_toc.py
+++ mutant/scripts/gen_toc.py
@@ -478,7 +478,7 @@
     Unicode lookalikes; no character is allowed inside the closing tag.
     #440 removes the inner-blank escape and the cross-name withholding
     measured on PR #428 ([R85] F2, [R86] F1)."""
-    return bool(re.search(r"</(?:%s)>" % "|".join(RAW_HTML_TAGS), line, ASCII_FOLD))
+    return bool(re.search(r"</(?:%s)>" % "pre|script|textarea", line, ASCII_FOLD))
 
 
 def _still_open(line: str, state: str, delim: str,
