review-evidence/440-r1/reviews/R225-1/mutations/no-opening-close/change.patch
--- head/scripts/gen_toc.py
+++ mutant/scripts/gen_toc.py
@@ -518,7 +518,7 @@
     html = RAW_HTML_OPEN_RE.match(line)
     if html:
         tag = html.group(1)
-        closed = _type_1_end(line)
+        closed = False
         return HTML, (TEXT if closed else HTML), "", tag
     if HTML_BLOCK_OPEN_RE.match(line) or (para != PARAGRAPH
                                           and HTML_TAG_LINE_RE.match(line)):
