review-evidence/440-r1/round2/reviews/R226-2/mutants-head/R25-generator-reader-no-newline-translation.patch
--- a/scripts/gen_toc.py
+++ b/scripts/gen_toc.py
@@ -892,7 +892,7 @@
     changed, missing, stale, refused = [], [], [], []
 
     for md in targets:
-        text = md.read_text()
+        text = md.read_bytes().decode("utf-8")
         rel = md.relative_to(REPO)
         notes = refusal_notes(str(rel), text)
         for note in notes:
