review-evidence/517-r1/reviews/R245-1/public/policy-correction/author/mutations/allow-bare-literal-path.patch
--- original/check_baremetal_only.py
+++ mutated/check_baremetal_only.py
@@ -1491,5 +1491,7 @@
     return 0
 
 
+HOST_RUNTIME_MASKS['tb/verilator/milan_dp/sim_pool.py'] = re.compile(re.escape("/proc/self/task/{os.getpid()}/children"))
+
 if __name__ == "__main__":
     sys.exit(main())
