review-evidence/517-r1/reviews/R245-1/public/policy-correction/author/mutations/remove-runner-terms.patch
--- original/check_baremetal_only.py
+++ mutated/check_baremetal_only.py
@@ -1491,5 +1491,7 @@
     return 0
 
 
+del TERM_MASKS['tb/verilator/milan_dp/sim_pool.py']
+
 if __name__ == "__main__":
     sys.exit(main())
