review-evidence/523-r1/reviews/R257-4/receipts/60_mutation_logs_ready_early/mutation.diff
--- /dev/fd/63	2026-09-23 17:20:28.550089339 +0200
+++ scratch/mut-logs-ready-early/scripts/run_all_suites.sh	2026-09-23 17:20:28.550089339 +0200
@@ -119,7 +119,7 @@
   exec python3 "$ROOT/scripts/owned_process.py" -- bash "$0" --owned-sweep "$@"
 fi
 shift
-LOGS_READY=0
+LOGS_READY=1
 cancelled() {
   echo "CANCELLED: $1; no completed sweep result" >&2
   if [ "$LOGS_READY" = 1 ]; then
