review-evidence/529-r1/correction-a216/mutants/r268/r3_crf_pend_stuck.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -1789,8 +1789,13 @@
   wire        crf_locked_w;
   //! ...and the seven with no CSR slice. Their one reader is the
   //! GET_COUNTERS row for STREAM_INPUT N_STREAMS (#529), which serves all ten
-  wire [31:0] crf_lockcnt_w, crf_unlockcnt_w, crf_intrcnt_w;
-  wire [31:0] crf_mrcnt_w, crf_tucnt_w, crf_latecnt_w, crf_earlycnt_w;
+  wire [31:0] crf_lockcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_unlockcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_intrcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_mrcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_tucnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_latecnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_earlycnt_w /* verilator public_flat_rw */;
   //! the CRF Media Clock Input's Table 5.22 counter-change pulse (gh #60 F2),
   //! consumed by the descriptor arbiter in front of KL_pp_shadow
   wire        crf_dirty_p_w;
@@ -7257,7 +7262,7 @@
     pp_ctr_sout_pend_n = pp_ctr_sout_pend_r | tkd_dirty_p_w;
     pp_ctr_avb_pend_n  = pp_ctr_avb_pend_r  | ctr_avb_dirty_w;
     pp_ctr_ckd_pend_n  = pp_ctr_ckd_pend_r  | ctr_ckd_dirty_w;
-    for (int unsigned s = 0; s < PP_CTR_SIN_N_C; s++) begin
+    for (int unsigned s = 0; s < N_STREAMS; s++) begin
       if (pp_ctr_evt_valid_w
           && (pp_ctr_evt_type_w == DESC_STREAM_INPUT_C)
           && (pp_ctr_evt_index_w == 16'(s))) pp_ctr_sin_pend_n[s] = 1'b0;
