review-evidence/529-r1/correction-a216/mutants/r269/ma4_crf_arm_no_index_first.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -3544,8 +3544,9 @@
 
   //! Everything else, including ENTITY and out-of-range indices, answers zero data
   //! AND an empty mask on the same term, so the two can never disagree.
-  assign ctr_ans_raw_w = ctr_sin_w ? ctr_blk_w
-                       : ctr_crf_w ? ctr_crf_blk_w
+  assign ctr_ans_raw_w = ((ACMP_SINKS_C > N_STREAMS)
+                          && (ctrq_type_r == DESC_STREAM_INPUT_C)) ? ctr_crf_blk_w
+                       : ctr_sin_w ? ctr_blk_w
                        : ctr_sout_w ? ctr_sout_blk_w
                        : ctr_avb_w ? ctr_avb_blk_w
                        : ctr_ckd_w ? ctr_ckd_blk_w
