review-evidence/529-r1/correction-a216/mutants/r269/mx3_port_swap_late_early.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5488,8 +5488,8 @@
     //! (CRF_STATUS 0x74C), truncated there and full-width on the wire.
     .mr_cnt_o    (crf_mrcnt_w),
     .tu_cnt_o    (crf_tucnt_w),
-    .late_cnt_o  (crf_latecnt_w),
-    .early_cnt_o (crf_earlycnt_w),
+    .late_cnt_o  (crf_earlycnt_w),
+    .early_cnt_o (crf_latecnt_w),
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
     .cnt_unlocked_o (crf_unlockcnt_w),
