review-evidence/529-r1/correction-a216/mutants/r269/mx4_port_swap_intr_locked.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5491,9 +5491,9 @@
     .late_cnt_o  (crf_latecnt_w),
     .early_cnt_o (crf_earlycnt_w),
     .locked_o    (crf_locked_w),
-    .cnt_locked_o   (crf_lockcnt_w),
+    .cnt_locked_o   (crf_intrcnt_w),
     .cnt_unlocked_o (crf_unlockcnt_w),
-    .cnt_intr_o     (crf_intrcnt_w),
+    .cnt_intr_o     (crf_lockcnt_w),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
     //! of KL_pp_shadow delivers it as {STREAM_INPUT, N_STREAMS} to the
     //! processor's rate-limited counter-change scheduler
