review-evidence/529-r1/correction-a222/mutants/dirty_also_other.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -7244,7 +7244,7 @@
           pp_ctr_evt_type_w  = DESC_STREAM_OUTPUT_C;
           pp_ctr_evt_index_w = 16'(pick - PP_CTR_SIN_N_C);
         end else if (pick == (PP_CTR_SIN_N_C + ACMP_SRC_C)) begin
-          pp_ctr_evt_type_w  = DESC_AVB_INTERFACE_C;
+          pp_ctr_evt_type_w  = DESC_AVB_INTERFACE_C; pp_ctr_evt_index_w = 16'd1;
         end else begin
           pp_ctr_evt_type_w  = DESC_CLOCK_DOMAIN_C;
         end
@@ -7255,7 +7255,7 @@
   always_comb begin : pp_ctr_event_next
     pp_ctr_sin_pend_n  = pp_ctr_sin_pend_r  | pp_ctr_sin_dirty_w;
     pp_ctr_sout_pend_n = pp_ctr_sout_pend_r | tkd_dirty_p_w;
-    pp_ctr_avb_pend_n  = pp_ctr_avb_pend_r  | ctr_avb_dirty_w;
+    pp_ctr_avb_pend_n  = pp_ctr_avb_pend_r  | ctr_avb_dirty_w | crf_dirty_p_w;
     pp_ctr_ckd_pend_n  = pp_ctr_ckd_pend_r  | ctr_ckd_dirty_w;
     for (int unsigned s = 0; s < PP_CTR_SIN_N_C; s++) begin
       if (pp_ctr_evt_valid_w
