review-evidence/529-r1/reviews/R268-1/receipts/mutants/r7_pick_sin_old/mutant.diff
--- <packet>/scratch/head/hdl/milan/milan_datapath.sv	2026-09-23 20:33:48.759000000 +0200
+++ <packet>/scratch/mut/r7_pick_sin_old/milan_datapath.sv	2026-09-23 21:01:15.350000000 +0200
@@ -1789,8 +1789,13 @@
   wire        crf_locked_w;
   //! ...and the seven with no CSR slice. Their one reader is the
   //! GET_COUNTERS row for STREAM_INPUT N_STREAMS (#529), which serves all ten
-  wire [31:0] crf_lockcnt_w, crf_unlockcnt_w, crf_intrcnt_w;
-  wire [31:0] crf_mrcnt_w, crf_tucnt_w, crf_latecnt_w, crf_earlycnt_w;
+  wire [31:0] crf_lockcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_unlockcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_intrcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_mrcnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_tucnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_latecnt_w /* verilator public_flat_rw */;
+  wire [31:0] crf_earlycnt_w /* verilator public_flat_rw */;
   //! the CRF Media Clock Input's Table 5.22 counter-change pulse (gh #60 F2),
   //! consumed by the descriptor arbiter in front of KL_pp_shadow
   wire        crf_dirty_p_w;
@@ -7237,7 +7242,7 @@
       if (pick >= PP_CTR_EVT_N_C) pick = pick - PP_CTR_EVT_N_C;
       if (!pp_ctr_evt_valid_w && pp_ctr_all_pend_w[pick]) begin
         pp_ctr_evt_valid_w = 1'b1;
-        if (pick < PP_CTR_SIN_N_C) begin
+        if (pick < N_STREAMS) begin
           pp_ctr_evt_type_w  = DESC_STREAM_INPUT_C;
           pp_ctr_evt_index_w = 16'(pick);
         end else if (pick < (PP_CTR_SIN_N_C + ACMP_SRC_C)) begin
