review-evidence/529-r1/reviews/R268-2/receipts/mutant_diffs/pend_crf_stuck.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -7258,7 +7258,7 @@
     pp_ctr_avb_pend_n  = pp_ctr_avb_pend_r  | ctr_avb_dirty_w;
     pp_ctr_ckd_pend_n  = pp_ctr_ckd_pend_r  | ctr_ckd_dirty_w;
     for (int unsigned s = 0; s < PP_CTR_SIN_N_C; s++) begin
-      if (pp_ctr_evt_valid_w
+      if ((s < N_STREAMS) && pp_ctr_evt_valid_w
           && (pp_ctr_evt_type_w == DESC_STREAM_INPUT_C)
           && (pp_ctr_evt_index_w == 16'(s))) pp_ctr_sin_pend_n[s] = 1'b0;
     end
