review-evidence/529-r1/reviews/R268-2/receipts/mutant_diffs/swap_early_cnt_o__cnt_unlocked_o.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5489,10 +5489,10 @@
     .mr_cnt_o    (crf_mrcnt_w),
     .tu_cnt_o    (crf_tucnt_w),
     .late_cnt_o  (crf_latecnt_w),
-    .early_cnt_o (crf_earlycnt_w),
+    .early_cnt_o (crf_unlockcnt_w),
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
-    .cnt_unlocked_o (crf_unlockcnt_w),
+    .cnt_unlocked_o (crf_earlycnt_w),
     .cnt_intr_o     (crf_intrcnt_w),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
     //! of KL_pp_shadow delivers it as {STREAM_INPUT, N_STREAMS} to the
