review-evidence/529-r1/reviews/R268-2/receipts/mutant_diffs/unbind_cnt_intr_o.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5493,12 +5493,13 @@
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
     .cnt_unlocked_o (crf_unlockcnt_w),
-    .cnt_intr_o     (crf_intrcnt_w),
+    .cnt_intr_o     (),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
     //! of KL_pp_shadow delivers it as {STREAM_INPUT, N_STREAMS} to the
     //! processor's rate-limited counter-change scheduler
     .dirty_p_o      (crf_dirty_p_w)
   );
+  assign crf_intrcnt_w = 32'd0;
 
   // ==========================================================================
   //  CRF media-clock recovery ACTUATOR (Milan 7.3.4): the audio-MMCM servo.
