review-evidence/529-r1/reviews/R268-2/receipts/mutant_diffs/unbind_cnt_locked_o.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5491,7 +5491,7 @@
     .late_cnt_o  (crf_latecnt_w),
     .early_cnt_o (crf_earlycnt_w),
     .locked_o    (crf_locked_w),
-    .cnt_locked_o   (crf_lockcnt_w),
+    .cnt_locked_o   (),
     .cnt_unlocked_o (crf_unlockcnt_w),
     .cnt_intr_o     (crf_intrcnt_w),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
@@ -5499,6 +5499,7 @@
     //! processor's rate-limited counter-change scheduler
     .dirty_p_o      (crf_dirty_p_w)
   );
+  assign crf_lockcnt_w = 32'd0;
 
   // ==========================================================================
   //  CRF media-clock recovery ACTUATOR (Milan 7.3.4): the audio-MMCM servo.
