review-evidence/529-r1/reviews/R269-2/receipts/mutants/vx-late_cnt-cnt_intr.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5488,12 +5488,12 @@
     //! (CRF_STATUS 0x74C), truncated there and full-width on the wire.
     .mr_cnt_o    (crf_mrcnt_w),
     .tu_cnt_o    (crf_tucnt_w),
-    .late_cnt_o  (crf_latecnt_w),
+    .late_cnt_o  (crf_intrcnt_w),
     .early_cnt_o (crf_earlycnt_w),
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
     .cnt_unlocked_o (crf_unlockcnt_w),
-    .cnt_intr_o     (crf_intrcnt_w),
+    .cnt_intr_o     (crf_latecnt_w),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
     //! of KL_pp_shadow delivers it as {STREAM_INPUT, N_STREAMS} to the
     //! processor's rate-limited counter-change scheduler
