review-evidence/529-r1/reviews/R269-2/receipts/mutants/vx-mr_cnt-cnt_unlocked.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5486,13 +5486,13 @@
     //! the three above are the GET_COUNTERS row for STREAM_INPUT N_STREAMS
     //! (ctr_crf_block). Only pdu, fmt_err and seq_err also have a CSR slice
     //! (CRF_STATUS 0x74C), truncated there and full-width on the wire.
-    .mr_cnt_o    (crf_mrcnt_w),
+    .mr_cnt_o    (crf_unlockcnt_w),
     .tu_cnt_o    (crf_tucnt_w),
     .late_cnt_o  (crf_latecnt_w),
     .early_cnt_o (crf_earlycnt_w),
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
-    .cnt_unlocked_o (crf_unlockcnt_w),
+    .cnt_unlocked_o (crf_mrcnt_w),
     .cnt_intr_o     (crf_intrcnt_w),
     //! ...and that row's Table 5.22 source: the descriptor arbiter in front
     //! of KL_pp_shadow delivers it as {STREAM_INPUT, N_STREAMS} to the
