review-evidence/529-r1/reviews/R269-2/receipts/mutants/vx-tu_cnt-early_cnt.diff
--- a/hdl/milan/milan_datapath.sv
+++ b/hdl/milan/milan_datapath.sv
@@ -5487,9 +5487,9 @@
     //! (ctr_crf_block). Only pdu, fmt_err and seq_err also have a CSR slice
     //! (CRF_STATUS 0x74C), truncated there and full-width on the wire.
     .mr_cnt_o    (crf_mrcnt_w),
-    .tu_cnt_o    (crf_tucnt_w),
+    .tu_cnt_o    (crf_earlycnt_w),
     .late_cnt_o  (crf_latecnt_w),
-    .early_cnt_o (crf_earlycnt_w),
+    .early_cnt_o (crf_tucnt_w),
     .locked_o    (crf_locked_w),
     .cnt_locked_o   (crf_lockcnt_w),
     .cnt_unlocked_o (crf_unlockcnt_w),
