review-evidence/529-r1/reviews/R269-3/receipts/mutants/X13_dirty_source_removed.diff
--- head/hdl/milan/milan_datapath.sv
+++ X13_dirty_source_removed/hdl/milan/milan_datapath.sv
@@ -7210,7 +7210,7 @@
                                          ? $clog2(PP_CTR_EVT_N_C) : 1;
   wire  [PP_CTR_SIN_N_C-1:0] pp_ctr_sin_dirty_w;
   if (PP_CTR_SIN_N_C > N_STREAMS) begin : g_ctr_crf_dirty
-    assign pp_ctr_sin_dirty_w = {crf_dirty_p_w, avtprx_dirty_p_w};
+    assign pp_ctr_sin_dirty_w = {1'b0, avtprx_dirty_p_w};
   end else begin : g_ctr_no_crf_dirty
     assign pp_ctr_sin_dirty_w = avtprx_dirty_p_w;
   end
