review-evidence/pp120-r1/reviews/R334-1/receipts/05-reviewer-mutants/M10-first-lane-per-command.diff
diff -ru <packet>/scratch/head/hdl/aecp/KL_aecp_desc_store.sv <packet>/scratch/mut/M10-first-lane-per-command/hdl/aecp/KL_aecp_desc_store.sv
--- <packet>/scratch/head/hdl/aecp/KL_aecp_desc_store.sv	2026-09-26 12:29:46.000000000 +0200
+++ <packet>/scratch/mut/M10-first-lane-per-command/hdl/aecp/KL_aecp_desc_store.sv	2026-09-26 13:19:16.672461671 +0200
@@ -454,7 +454,13 @@
   assign take_wr_w = st_req_i &&  st_we_i && st_ready_o;
   //! The live RAM write acceptance, before the boot-load mux. No new state
   //! or command decode: this is the same enable that writes the name lane.
-  assign name_wr_o = take_wr_w && st_name_i;
+  logic mut_seen_r;
+  always_ff @(posedge clk_i) begin : mut_seen
+    if (!rst_n) mut_seen_r <= 1'b0;
+    else if (take_wr_w && st_name_i) mut_seen_r <= 1'b1;
+    else if (st_req_i && !st_name_i) mut_seen_r <= 1'b0;
+  end
+  assign name_wr_o = (take_wr_w && st_name_i) && !mut_seen_r;
 
   assign st_rvalid_o = ans_pend_r && !rd_pipe_r && (st_r == S_ANSWER);
   assign st_rdata_o  = ans_data_r;
@@ -542,7 +548,7 @@
       name_wdata_w = mem_rsp_data_i;
       name_wstrb_w = 8'hFF;
     end else begin
-      name_we_w    = name_wr_o;
+      name_we_w    = take_wr_w && st_name_i;
       name_waddr_w = NAME_AW_C'(st_addr_i[15:3]);
       name_wdata_w = st_wdata_i;
       name_wstrb_w = st_wstrb_i;
