review-evidence/pp510-r1/reviews/R318-1/receipts/05-rtl-mutant-any-type-milan-info.diff
--- a/hdl/aecp/KL_aecp_engine.sv
+++ b/hdl/aecp/KL_aecp_engine.sv
@@ -1293,7 +1293,7 @@
                                 && (raw_ct_r   == MVU_PID_HI_C)
                                 && (cfg_ix_r   == MVU_PID_MD_C)
                                 && (pid_lo_r   == 2'b11)
-                                && (desc_ty_r  == MVU_GET_MILAN_INFO_C);
+                                && (desc_ty_r[14:3] == 12'd0);  // R318 probe: 0x0000..0x0007 all get Figure 5.4
 
   // ---- payload sizing ------------------------------------------------------
   //! cdl is the offset-from-@12 length (F06.14), so the command payload is
