review-evidence/pp94-r1/reviews/R290-2/receipts/mutants/G3-err-not-terminal.diff
diff -ru $PACKET/scratch/head/hdl/aecp/KL_aecp_desc_mem_guard.sv $PACKET/scratch/mut/G3-err-not-terminal/hdl/aecp/KL_aecp_desc_mem_guard.sv
--- $PACKET/scratch/head/hdl/aecp/KL_aecp_desc_mem_guard.sv	2026-09-24 11:55:35.000000000 +0200
+++ $PACKET/scratch/mut/G3-err-not-terminal/hdl/aecp/KL_aecp_desc_mem_guard.sv	2026-09-24 12:10:05.115426618 +0200
@@ -72,7 +72,7 @@
     end else if (m_req_valid_o && m_req_ready_i) begin
       owed_r <= 1'b1;
     end else if (m_rsp_valid_i && m_rsp_ready_o
-                 && (m_rsp_last_i || m_rsp_err_i)) begin
+                 && m_rsp_last_i) begin
       owed_r <= 1'b0;
     end
   end
